{"cells":[{"metadata":{},"cell_type":"markdown","source":"## Задание 1\nДана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей."},{"metadata":{"trusted":true},"cell_type":"code","source":"ids = {'user1': [213, 213, 213, 15, 213],\n'user2': [54, 54, 119, 119, 119],\n'user3': [213, 98, 98, 35]}\npoints = []\nfor el in ids:\n    points.extend(ids.get(el))\nset(points)\n    ","execution_count":11,"outputs":[{"data":{"text/plain":"{15, 35, 54, 98, 119, 213}"},"execution_count":11,"metadata":{},"output_type":"execute_result"}]},{"metadata":{},"cell_type":"markdown","source":"## Задание 2\nДана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде."},{"metadata":{"trusted":true},"cell_type":"code","source":"queries = [\n'смотреть сериалы онлайн',\n'новости спорта',\n'афиша кино',\n'курс доллара',\n'сериалы этим летом',\n'курс по питону',\n'сериалы про спорт Привет',\n]","execution_count":37,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"stat = []\ncount = 0;\ntotal = len(queries)\nfor el in queries:\n    stat.append((len(el.split(' '))))\nstat_set = set(stat)\nfor el_set in stat_set:\n    print(f'Поисковых запросов, содержащих {el_set} слов(а): ', round(stat.count(el_set) / total * 100,2))\n    ","execution_count":38,"outputs":[{"name":"stdout","output_type":"stream","text":"Поисковых запросов, содержащих 2 слов(а):  42.86\nПоисковых запросов, содержащих 3 слов(а):  42.86\nПоисковых запросов, содержащих 4 слов(а):  14.29\n"}]},{"metadata":{},"cell_type":"markdown","source":"## Задание 3\nДана переменная, в которой хранится информация о затратах и доходе рекламных кампаний по различным источникам. Необходимо дополнить исходную структуру показателем ROI, который рассчитаем по формуле: (revenue / cost - 1) * 100"},{"metadata":{"trusted":true},"cell_type":"code","source":"results = {\n'vk': {'revenue': 103, 'cost': 98},\n'yandex': {'revenue': 179, 'cost': 153},\n'facebook': {'revenue': 103, 'cost': 110},\n'adwords': {'revenue': 35, 'cost': 34},\n'twitter': {'revenue': 11, 'cost': 24},\n}","execution_count":32,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"for el in results:\n    el_dict_data = results.get(el)\n    revenue = el_dict_data.get('revenue')\n    cost = el_dict_data.get('cost')\n    if cost != 0:\n        ROI  = (revenue / cost - 1) * 100\n        el_dict_data.update({'ROI': round(ROI,2)})\n    else:\n        el_dict_data.update({'ROI': '--'})\nprint(results)","execution_count":34,"outputs":[{"name":"stdout","output_type":"stream","text":"{'vk': {'revenue': 103, 'cost': 98, 'ROI': 5.1}, 'yandex': {'revenue': 179, 'cost': 153, 'ROI': 16.99}, 'facebook': {'revenue': 103, 'cost': 110, 'ROI': -6.36}, 'adwords': {'revenue': 35, 'cost': 34, 'ROI': 2.94}, 'twitter': {'revenue': 11, 'cost': 24, 'ROI': -54.17}}\n"}]},{"metadata":{},"cell_type":"markdown","source":"## Задание 4\nДана переменная, в которой хранится статистика рекламных каналов по объемам продаж (пример структуры данных приведен ниже). Напишите программу, которая возвращает название канала с максимальным объемом продаж."},{"metadata":{"trusted":true},"cell_type":"code","source":"stats = {'facebook': 55, 'yandex': 115, 'vk': 120, 'google': 99, 'email': 42, 'ok': 98}","execution_count":39,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"list(stats)\nmax_el = ''\nmax_tr = 0\nfor w in stats:\n    trd = stats.get(w)\n    if trd>max_tr:\n        max_el = w\n        max_tr = trd\nprint(max_el)\n","execution_count":58,"outputs":[{"name":"stdout","output_type":"stream","text":"vk\n"}]},{"metadata":{},"cell_type":"markdown","source":"## Задание 5 (необязательно)\nДан список произвольной длины. Необходимо написать код, который на основе исходного списка составит словарь такого уровня вложенности, какова длина исхондого списка."},{"metadata":{"trusted":true},"cell_type":"code","source":"my_list = ['2018-01-01', 'yandex', 'cpc', 100]","execution_count":2,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"my_list = ['a', 'b', 'c', 'd', 'e', 'f']","execution_count":83,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"my_list.reverse()\ndic = ''\nfor el in my_list:\n    if dic=='':\n        dic = el\n        continue\n    dic = {el:dic}\ndic    ","execution_count":3,"outputs":[{"output_type":"execute_result","execution_count":3,"data":{"text/plain":"{'2018-01-01': {'yandex': {'cpc': 100}}}"},"metadata":{}}]},{"metadata":{},"cell_type":"markdown","source":"## Задание 6 (необязательно)\nДана книга рецептов с информацией о том, сколько ингредиентов нужно для приготовления блюда в расчете на одну порцию (пример данных представлен ниже).\nНапишите программу, которая будет запрашивать у пользователя количество порций для приготовления этих блюд и отображать информацию о суммарном количестве требуемых ингредиентов в указанном виде."},{"metadata":{"trusted":true},"cell_type":"code","source":"cook_book = {\n'салат': [\n{'ingridient_name': 'сыр', 'quantity': 50, 'measure': 'гр'},\n{'ingridient_name': 'томаты', 'quantity': 20, 'measure': 'гр'},\n{'ingridient_name': 'огурцы', 'quantity': 20, 'measure': 'гр'},\n{'ingridient_name': 'маслины', 'quantity': 10, 'measure': 'гр'},\n{'ingridient_name': 'оливковое масло', 'quantity': 20, 'measure': 'мл'},\n{'ingridient_name': 'салат', 'quantity': 10, 'measure': 'гр'},\n{'ingridient_name': 'перец', 'quantity': 20, 'measure': 'гр'}\n],\n'пицца': [\n{'ingridient_name': 'сыр', 'quantity': 20, 'measure': 'гр'},\n{'ingridient_name': 'колбаса', 'quantity': 30, 'measure': 'гр'},\n{'ingridient_name': 'бекон', 'quantity': 30, 'measure': 'гр'},\n{'ingridient_name': 'оливки', 'quantity': 10, 'measure': 'гр'},\n{'ingridient_name': 'томаты', 'quantity': 20, 'measure': 'гр'},\n{'ingridient_name': 'тесто', 'quantity': 100, 'measure': 'гр'},\n],\n'лимонад': [\n{'ingridient_name': 'лимон', 'quantity': 1, 'measure': 'шт'},\n{'ingridient_name': 'вода', 'quantity': 200, 'measure': 'мл'},\n{'ingridient_name': 'сахар', 'quantity': 10, 'measure': 'гр'},\n{'ingridient_name': 'лайм', 'quantity': 20, 'measure': 'гр'},\n]\n}","execution_count":4,"outputs":[]},{"metadata":{"trusted":true},"cell_type":"code","source":"#cnt = int(input('Введите количество порций'))\ncnt = 3\nres = {}\nfor el in cook_book:\n    for ing in cook_book.get(el):\n        ingridient_name = ing.get('ingridient_name')\n        tmp = res.get(ingridient_name,0)\n        if tmp == 0:\n            res.update({ingridient_name: {'quantity': ing.get('quantity'), 'measure': ing.get('measure')}})\n        else:\n            quantity = tmp.get('quantity')\n            tmp.update({'quantity':quantity + ing.get('quantity')})\nfor el in res:\n    print(str(el)+': '+str(res[el]['quantity']*cnt)+' '+str(res[el]['measure']))\n\n\n","execution_count":68,"outputs":[{"output_type":"stream","text":"сыр: 210 гр\nтоматы: 120 гр\nогурцы: 60 гр\nмаслины: 30 гр\nоливковое масло: 60 мл\nсалат: 30 гр\nперец: 60 гр\nколбаса: 90 гр\nбекон: 90 гр\nоливки: 30 гр\nтесто: 300 гр\nлимон: 3 шт\nвода: 600 мл\nсахар: 30 гр\nлайм: 60 гр\n","name":"stdout"}]}],"metadata":{"kernelspec":{"name":"python3","display_name":"Python 3","language":"python"},"language_info":{"name":"python","version":"3.6.11","mimetype":"text/x-python","codemirror_mode":{"name":"ipython","version":3},"pygments_lexer":"ipython3","nbconvert_exporter":"python","file_extension":".py"}},"nbformat":4,"nbformat_minor":2}